In [10]:
#dependencies
import pandas as pd
import numpy as np

In [11]:
# File to Load (Remember to Change These)
filepath = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(filepath)

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [13]:
df.shape

(780, 7)

# Player Count

In [14]:
#finding total unique players
players = df.SN.nunique()

summ1 = pd.DataFrame()
summ1["Total Players"] = [players]

summ1

   Total Players
0            576

In [15]:
df["Item ID"].nunique()

179

In [16]:
df.Price.mean()

3.050987179487176

In [17]:
df.Price.sum()

2379.77

# Purchasing Analysis(Total)

In [18]:
#calculate and form summary table for purchases
totalPlayers = df.SN.nunique()
avgPrice = df.Price.mean()
totalRows = len(df)
totalPrice = df.Price.sum()



summ2 = pd.DataFrame()
summ2["Number of Unique Items"] = [totalRows]
summ2["Average Price"] = [avgPrice]
summ2["Number of Purchases"] = [totalRows]
summ2["Total Revenue"] = [totalPrice]

summ2

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     780       3.050987                  780        2379.77

In [19]:
df.groupby("Gender").size()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
dtype: int64

In [20]:
cols = ["SN", "Age", "Gender"]

players = df.loc[:, cols]
players.head()

              SN  Age Gender
0        Lisim78   20   Male
1    Lisovynya38   40   Male
2     Ithergue48   24   Male
3  Chamassasya86   24   Male
4      Iskosia90   23   Male

In [21]:
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

In [22]:
players = players.drop_duplicates().reset_index(drop=True)

In [23]:
players.Gender.value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [24]:
players.Gender.value_counts() / len(players)

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [25]:
#https://stackoverflow.com/a/18062521

# Gender Demographics

In [39]:
#calculate and for summary table for Gender demographics 
playerCount = players.Gender.value_counts()
playerPercent = players.Gender.value_counts() / len(players)

summ3 = pd.concat([playerCount, playerPercent], axis =1)
summ3.columns = ["Total Count", "Percentage of Players"]
summ3

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [40]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [41]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

# Purchasing Analysis (Gender)

In [42]:
#calculate and form summary table for purchase data grouped by gender
summ4 =df.groupby("Gender").agg({"Purchase ID":"count", "Price":["mean", "sum"]})
summ4.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value"]
summ4["Avg Total Puchase per Person"]= summ4["Total Purchase Value"] / summ3["Total Count"]
summ4

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [43]:
#creating bins
bins = [0, 9, 14, 19, 24, 29, 34, 39, 1000]

#bin labels
group_labels = ["<10", "10-14", "15-19", "20-24","25-29","30-34", "34-39", "40+"]

In [44]:
df["Age Group"] = pd.cut(df.Age, bins, labels=group_labels, include_lowest=True)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [45]:
cols = ["SN", "Age", "Gender","Age Group"]

players = df.loc[:, cols]
players.head()

              SN  Age Gender Age Group
0        Lisim78   20   Male     20-24
1    Lisovynya38   40   Male       40+
2     Ithergue48   24   Male     20-24
3  Chamassasya86   24   Male     20-24
4      Iskosia90   23   Male     20-24

In [46]:
players = players.drop_duplicates().reset_index(drop=True)
players.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   SN         576 non-null    object
 1   Age        576 non-null    int64
 2   Gender     576 non-null    object
 3   Age Group  576 non-null    category
dtypes: category(1), int64(1), object(2)
memory usage: 14.5+ KB

# Age Demographics

In [47]:
#calculate and form summary table for Age Demographics
playerCount = players.groupby("Age Group").size()
playerPercent = players.groupby("Age Group").size() / len(players)

summ5 = pd.concat([playerCount, playerPercent], axis =1)
summ5.columns = ["Total Count", "Percentage of Players"]
summ5

           Total Count  Percentage of Players
Age Group
<10                 17               0.029514
10-14               22               0.038194
15-19              107               0.185764
20-24              258               0.447917
25-29               77               0.133681
30-34               52               0.090278
34-39               31               0.053819
40+                 12               0.020833

#  Purchasing Analysis (Age)

In [48]:
#calculate and form summary table for purchase data (age)
summ6 =df.groupby("Age Group").agg({"Purchase ID":"count", "Price":["mean", "sum"]})
summ6.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value"]
summ6["Avg Total Puchase per Person"]= summ6["Total Purchase Value"] / summ5["Total Count"]
summ6

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
34-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

# Top Spenders

In [49]:
#calculate and form summary table for Top Spenders
summ7 =df.groupby("SN").agg({"Purchase ID":"count", "Price":["mean", "sum"]})
summ7.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value"]
summ7.sort_values(by="Total Purchase Value", ascending=False, inplace=True)
summ7.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

# Most Popular Items

In [50]:
#calculate and form summary table for most popular items
summ8 =df.groupby(["Item ID", "Item Name"]).agg({"Purchase ID":"count", "Price":["mean", "sum"]})
summ8.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value"]
summ8.sort_values(by="Purchase Count", ascending=False, inplace=True)
summ8.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

# Most Profitable Items

In [53]:
#re-sort and form table for the most profitable items 
summ8.sort_values(by="Total Purchase Value", ascending=False, inplace=True)
summ8.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80